In [3]:
try:
        file = open("pandas.csv", "x")
        file.close()
except:
        print("The file is already there.")

The file is already there.

In [7]:
import pandas as pd
df = pd.read_csv("pandas.csv")
df

   Sn    Name  Age    Address          Phone
0   1     Ram   34  kathmandu    98023412343
1   2   Shyam   35   Lalitpur     9821341233
2   3    Hari   36  Bhaktapur    98491234123
3   4    Sita   37  Koteshwor    98732491234
4   5    Gita   38    Tinkune  9812341234123
5   6  Alisha   39    Gaighat    98123419093

In [10]:
df.head(3)

   Sn   Name  Age    Address        Phone
0   1    Ram   34  kathmandu  98023412343
1   2  Shyam   35   Lalitpur   9821341233
2   3   Hari   36  Bhaktapur  98491234123

In [13]:
df.tail(3)

   Sn    Name  Age    Address          Phone
3   4    Sita   37  Koteshwor    98732491234
4   5    Gita   38    Tinkune  9812341234123
5   6  Alisha   39    Gaighat    98123419093

In [19]:
import pandas as pd
df = pd.read_csv("pandas.csv",index_col= "Sn",usecols = ["Sn","Name","Age"])
df

      Name  Age
Sn
1      Ram   34
2    Shyam   35
3     Hari   36
4     Sita   37
5     Gita   38
6   Alisha   39

In [23]:
 import pandas as pd
df = pd.read_csv("pandas.csv",index_col= "Sn")
df.iloc[0:3,0:3]

     Name  Age    Address
Sn
1     Ram   34  kathmandu
2   Shyam   35   Lalitpur
3    Hari   36  Bhaktapur

In [24]:
 import pandas as pd
df = pd.read_csv("pandas.csv",index_col= "Sn")
df.iloc[2:5]

    Name  Age    Address          Phone
Sn
3   Hari   36  Bhaktapur    98491234123
4   Sita   37  Koteshwor    98732491234
5   Gita   38    Tinkune  9812341234123

In [27]:
 import pandas as pd
df = pd.read_csv("pandas.csv",index_col= "Name")
df.loc["Shyam":"Alisha"]

        Sn  Age    Address          Phone
Name
Shyam    2   35   Lalitpur     9821341233
Hari     3   36  Bhaktapur    98491234123
Sita     4   37  Koteshwor    98732491234
Gita     5   38    Tinkune  9812341234123
Alisha   6   39    Gaighat    98123419093

In [32]:
 import pandas as pd
df = pd.read_csv("pandas.csv",index_col= "Sn")
df["Address"] == 'Gaighat'

Sn
1    False
2    False
3    False
4    False
5    False
6     True
Name: Address, dtype: bool

In [35]:
 import pandas as pd
df = pd.read_csv("pandas.csv",index_col= "Sn")
df[df["Address"] == 'Gaighat']

      Name  Age  Address        Phone
Sn
6   Alisha   39  Gaighat  98123419093
7     Arju   40  Gaighat  98912384112

In [41]:
 import pandas as pd
df = pd.read_csv("pandas.csv",index_col= "Sn")
df[(df["Address"] == 'Gaighat') & (df['Phone']==98123419093)]

      Name  Age  Address        Phone
Sn
6   Alisha   39  Gaighat  98123419093

In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\hp\anaconda3\lib\site-packages (2.2.9)

In [3]:
import mysql.connector  #importing database

database = mysql.connector.connect(
  host="localhost",
  user="root",
  password=""
)
db = database.cursor() 

db.execute("CREATE DATABASE pythons")

In [2]:
import mysql.connector  #importing database

database = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
   database = "pythonclass4pm"
)
db = database.cursor()

In [3]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 45, 60, 57, 98, 280, 85.0, 'B+')
(2, 'Nabin', 78, 60, 70, 80, 98, 380, 85.0, 'A+')
(3, 'Hari', 90, 23, 78, 65, 78, 234, 75.0, 'C')
(5, 'Diwash', 40, 50, 60, 70, 80, 290, 86.0, 'A')

In [21]:
db.execute("SELECT sn,name,total,percentage FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 280, 85.0)
(2, 'Nabin', 380, 85.0)
(3, 'Hari', 234, 75.0)

In [4]:
db.execute("SELECT * FROM student WHERE grade = 'A'")
result =db.fetchall()
for x in result:
    print(x)

(5, 'Diwash', 40, 50, 60, 70, 80, 290, 86.0, 'A')

In [30]:
sql = '''INSERT INTO student(sn, Name, Physics, Chemistry, Math, English, Nepali, Total, Percentage, Grade) 
VALUES (4, 'Pratik', 40, 50, 60, 70, 80,90,90.00 ,'A+')'''
db.execute(sql) 
database.commit()

IntegrityError: 1062 (23000): Duplicate entry '4' for key 'PRIMARY'

In [ ]:
#WAP to input values and save in database
sql = f'''INSERT INTO student (sn,name,physics)

In [31]:
sql = "DELETE FROM student WHERE sn = 4"
db.execute(sql)
database.commit()

In [6]:
sql = "UPDATE student SET name = 'Diwash' WHERE name = 'Pratik'"
db.execute(sql)
database.commit()